app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="form-check form-check-inline">
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>