app/views/articles/show.html.erb

		<div class="listing-category">
			<% @article.categories.each do |ac| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 37]]