app/views/users/_user.html.erb

					<li class="listing-body">
						<%= pluralize(u.articles.count, "article") if u.articles %>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 5]]