app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Post with User"], ["description", "This article is created by a user"], ["created_at", "2018-08-31 10:14:35.367932"], ["updated_at", "2018-08-31 10:14:35.367932"], ["user_id", 5]]

	def update
		if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "This is the content of my first post!!!"], ["updated_at", "2018-08-30 06:44:56.668257"], ["id", 1]]