app/controllers/categories_controller.rb

	def index
		@categories = Category.paginate(page: params[:page], per_page: 3)
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]