app/views/categories/_category.html.erb

				<li class="listing-body">
					<%= pluralize(c.articles.count, "article") if c.articles %>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 7]]