app/views/layouts/_categories.html.erb

<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"